{
  "version": "base",
  "header": {
    "name": "Sean Prince Tinashe Huvaya",
    "email": "shuvaya@mail.yu.edu",
    "phone": "+1 (347) 759-1641",
    "website": "https://seanhuvaya.dev",
    "linkedin": "https://linkedin.com/in/seanhuvaya",
    "github": "https://github.com/seanhuvaya",
    "location": "New York, NY, USA",
    "relocation": "Open to remote & relocation"
  },
  "summary": "Data Engineer with a backend engineering foundation and growing expertise in machine learning operations. Experienced in optimizing SQL queries, automating data pipelines, and deploying cloud-native applications with Docker and AWS. Worked across international teams to integrate machine learning models, refactor legacy systems, and build APIs supporting real-time data workflows. Currently pursuing a Master’s in AI and focused on combining data infrastructure, systems thinking, and model deployment to support scalable ML systems in production.",
  "experience": [
    {
      "id": 1,
      "organization": "Yeshiva University",
      "location": "New York, NY",
      "current": false,
      "positions": [
        {
          "id": 1,
          "title": "Supplementary Instructor, Introduction to Information Systems",
          "startDate": "Aug 2024",
          "endDate": "June 2025",
          "current": false,
          "highlights": [
            "Provided technical guidance to 30+ students in R programming and statistical data manipulation, reinforcing foundational data concepts used in real-world analytics and engineering workflows.",
            "Design and lead weekly mentoring sessions on topics such as data cleaning, visualization, and basic SQL, helping students develop practical skills for analyzing structured data.",
            "Collaborate with course instructors to refine teaching materials and align exercises with industry-relevant tools and concepts, including reproducibility and version control"
          ]
        }
      ]
    },
    {
      "id": 2,
      "organization": "CGA Technologies",
      "location": "Cheshire, UK (Remote)",
      "current": false,
      "positions": [
        {
          "id": 1,
          "title": "Software Developer",
          "startDate": "Oct 2022",
          "endDate": "Sep 2023",
          "current": false,
          "highlights": [
            "Optimized MySQL queries within the SCTP backend platform, reducing API latency by over 10% and improving system responsiveness for critical operations.",
            "Implemented 10+ backend and UI enhancements for SCTP using Java and Vue.js, improving system functionality across financial tracking and case management modules.",
            "Built and tested 2 reusable Vue.js components, reducing code duplication and streamlining frontend logic for consistent data display.",
            "Presented development updates to cross-functional teams and contributed to technical planning aligned with program requirements and stakeholder needs."
          ]
        }
      ]
    },
    {
      "id": 3,
      "organization": "CodeVirtus",
      "location": "Harare, Zimbabwe",
      "current": false,
      "positions": [
        {
          "id": 1,
          "title": "Backend Developer",
          "startDate": "Jun 2021",
          "endDate": "Nov 2022",
          "current": false,
          "highlights": [
            "Developed and published an NPM package to simplify integration with Pesepay APIs, streamlining developer adoption with an average of 40+ downloads per week.",
            "Spearheaded the design for automated image processing features for Claro Images, enabling consistent metadata generation and secure asset storage for downstream workflows.",
            "Customized SpringBoot-based open-source platforms to support diverse data models and system architectures across multiple client environments.",
            "Collaborated with backend engineers and product stakeholders to diagnose and resolve system-level issues impacting data consistency and platform reliability."
          ]
        }
      ]
    },
    {
      "id": 4,
      "organization": "Invenico",
      "location": "Harare, Zimbabwe",
      "current": false,
      "positions": [
        {
          "id": 1,
          "title": "Software Developer",
          "startDate": "Apr 2019",
          "endDate": "May 2021",
          "current": false,
          "highlights": [
            "Redesigned core backend workflows in collaboration with clients and engineers to optimize system functionality and streamline internal data operations.",
            "Refactored legacy Java code and implemented comprehensive unit testing, increasing test coverage to 72% and significantly reducing production issues.",
            "Modernized the MyNhaka life assurance portal by improving backend architecture for cleaner data flow and easier maintenance.",
            "Delivered 3 full-cycle backend systems using Java and SQL, supporting customer records, transactional data, and reporting tools."
          ]
        },
        {
          "id": 2,
          "title": "Android Developer",
          "startDate": "Jun 2018",
          "endDate": "Mar 2019",
          "current": false,
          "highlights": [
            "Built secure POS and wallet applications for enterprise clients, enabling mobile payments, receipt printing, and NFC card integration."
          ]
        }
      ]
    }
  ],
  "education": [
    {
      "school": "Yeshiva University",
      "degree": "Master of Science in Artificial Intelligence",
      "graduationDate": "Dec 2025",
      "location": "New York, USA"
    },
    {
      "school": "University of Zimbabwe",
      "degree": "B.Sc. Business Studies and Computing Science (Honors)",
      "graduationDate": "Dec 2021",
      "location": "Harare Zimbabwe"
    }
  ],
  "certifications": [
    {
      "title": "AWS Certified Solutions Architect - Associate",
      "date": "Dec 2025"
    }
  ],
  "skills": [
    {
      "category": "Languages & Frameworks",
      "items": [
        "Python",
        "Java",
        "SQL (PostgreSQL)",
        "R",
        "Bash",
        "SpringBoot"
      ]
    },
    {
      "category": "Data & ML Tools",
      "items": [
        "Pandas",
        "NumPy",
        "Scikit-learn",
        "PyTorch",
        "Jupyter",
        "Matplotlib"
      ]
    },
    {
      "category": "Cloud & Infrastructure",
      "items": [
        "AWS (EC2, S3, Lambda)",
        "Docker",
        "REST APIs",
        "GitHub",
        "Linux"
      ]
    },
    {
      "category": "Workflow & Ops",
      "items": [
        "CI/CD",
        "Containerization",
        "Data Pipelines",
        "Agile/SCRUM"
      ]
    }
  ]
}